## Staging: lambda-api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                       NAME                       |
|--------|--------------------------------------------------|
| add    | `aws_cloudwatch_log_group.api_lambda_log_group`  |
| update | `aws_cloudwatch_log_group.api_gateway_log_group` |
|        | `aws_iam_policy.api`                             |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.api_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "api_policies"  {
      ~ id      = "4051464752" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:239043911459:log-group:api_gateway_log_group"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:239043911459:repository/notify/api-lambda"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::notification-canada-ca-staging-csv-upload/*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "sqs:*",
                          - "sns:Publish",
                          - "securityhub:BatchImportFindings",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:DescribeParameters"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:239043911459:parameter/ENVIRONMENT_VARIABLES"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:NEW_RELIC_LICENSE_KEY-bDjJ9v"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "tag:GetResources",
                          - "lambda:ListTags",
                          - "lambda:ListFunctions",
                          - "lambda:ListEventSourceMappings",
                          - "lambda:ListAliases",
                          - "lambda:GetAccountSettings",
                          - "config:ListDiscoveredResources",
                          - "config:BatchGetResourceConfig",
                          - "cloudwatch:ListMetrics",
                          - "cloudwatch:GetMetricStatistics",
                          - "cloudwatch:GetMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_group.api_gateway_log_group will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "api_gateway_log_group" {
        id                = "api_gateway_log_group"
        name              = "api_gateway_log_group"
      ~ retention_in_days = 90 -> 0
      + skip_destroy      = false
        tags              = {
            "Application" = "lambda"
            "CostCenter"  = "notification-canada-ca-staging"
            "Environment" = "staging"
        }
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.api_lambda_log_group will be created
  + resource "aws_cloudwatch_log_group" "api_lambda_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/api-lambda"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Application" = "lambda"
          + "CostCenter"  = "notification-canada-ca-staging"
          + "Environment" = "staging"
        }
      + tags_all          = {
          + "Application" = "lambda"
          + "CostCenter"  = "notification-canada-ca-staging"
          + "Environment" = "staging"
        }
    }

  # aws_iam_policy.api will be updated in-place
  ~ resource "aws_iam_policy" "api" {
        id        = "arn:aws:iam::239043911459:policy/notify-api"
        name      = "notify-api"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:239043911459:log-group:api_gateway_log_group"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:239043911459:repository/notify/api-lambda"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::notification-canada-ca-staging-csv-upload/*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "sqs:*",
                          - "sns:Publish",
                          - "securityhub:BatchImportFindings",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:DescribeParameters"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:239043911459:parameter/ENVIRONMENT_VARIABLES"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:NEW_RELIC_LICENSE_KEY-bDjJ9v"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "tag:GetResources",
                          - "lambda:ListTags",
                          - "lambda:ListFunctions",
                          - "lambda:ListEventSourceMappings",
                          - "lambda:ListAliases",
                          - "lambda:GetAccountSettings",
                          - "config:ListDiscoveredResources",
                          - "config:BatchGetResourceConfig",
                          - "cloudwatch:ListMetrics",
                          - "cloudwatch:GetMetricStatistics",
                          - "cloudwatch:GetMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_wafv2_web_acl.api_lambda,
  on waf.tf line 1, in resource "aws_wafv2_web_acl" "api_lambda":
   1: resource "aws_wafv2_web_acl" "api_lambda" {

Use rule_action_override instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_lambda_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.ecr-user"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.firehose-api-lambda-waf-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.new-relic-license-key"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_lambda"]

35 tests, 17 passed, 18 warnings, 0 failures, 0 exceptions

```

</details>
